import React, { useState, useCallback } from 'react';
import {
    Row,
    Col,
    Modal,
    ModalHeader,
    ModalBody,
    ModalFooter,
    Button
} from 'reactstrap';

const CenteredTitle = ({ children }) => <h5 className="w-100">{children}</h5>;

const readmore = ({ isOpen, setIsOpen }) => {
    return (
        <Modal isOpen={isOpen} size='xl'>
            <ModalHeader tag={CenteredTitle} className="text-center" toggle={() => setIsOpen(false)}>
                Какво представлява „My5“?
            </ModalHeader>
            <ModalBody>
                <Row>
                    <Col md={{ size: 10, offset: 1 }} sm="12">
                        <p>Сайтът „My5“ представлява иновативно хранилище за файлове - една завършена система за локални облачни услуги, с която можете да създавате собствени потребителски папки и да качвате файлове. Идеята за направата на системата се получи, след като на няколко пъти срив в интернета на града затрудни достъпа до Google Drive и One Drive акаунтите на училището. Това наложи създаване на собствено решение за споделяне и съхранение на файлове от страна на учениците, което да се изпълнява в рамките на училището и да не се влияе от локалната свързаност към глобалната мрежа. От няколко години всеки от учениците в СУ “Васил Левски” - гр. Троян има лична ученическа карта, която му служи за пропуск.</p>
                        <p>Използвайки базата данни, която е създадена в училището, изготвихме нашата система, като в нея дадохме възможност всеки да влиза със своя уникален номер от  ученическата си карта и парола, която е получена от класния ръководител. Оказа се, че така създадената система е много подходяща за часовете по информатика и информационни технологии, където всеки един ученик може да записва файловете си в личния си облак и да ги достъпва по всяко време и от всяко устройство.</p>
                        <p>В изпълнението на тази главна цел създадохме кросплатформена система, в която всяко действие, което изпълните на едно от устройствата, веднага се изпълнява на другите. Например, ако сте влезли в системата през Вашия мобилен телефон, а в същото време в училище сте достъпили профила си през работната си станция, то качването на файла от телефона в системата, веднага ще се отрази и на компютъра. Самият сървър е зад два смарт рутера и достъпа до него се осъществява след поредица от разрешения. На него има инсталирани необходимите SSL сертификати, като за достъп се използва единствено TLS 1.2. Това дава достатъчна степен на защита на данните и предпазване на личните файлове на учениците. Благодарение на изградената вътрешна интранет мрежа на училището достъпа до нашето решение би бил невъзможен единствено когато няма ток, а това помага за много по-добро провеждане на часовете, защото подготвеното от учителя и качено в системата домашно от предния ден, на другия ден ще бъде достъпно за локално ползване в училище, дори и да няма интернет свързаност. Това позволява по-спокойно прецизиране на плана на уроците и създаване на една по-приятна атмосфера за провеждане на един интерактивен час.</p>
                        <p>Проектът е с лесен, отзивчив, интуитивен и опростен дизайн, като при направата на външния вид сме се стремили да отговорим на желанието на повечето ученици да могат без проблем да се ориентират и да създават съдържанието по удобен за тях начин. Използването на познати технологии като Bootstrap и NotifyJS спомага именно за горепосочените предимства.</p>
                    </Col>
                </Row>
            </ModalBody>
            <ModalFooter>
                <Button onClick={() => setIsOpen(false)} className="my-0 mx-auto" color="primary">
                    Разбрах
            </Button>
            </ModalFooter>
        </Modal>
    );
}



export default readmore;
